
   
# 4. Напишите программу. которая будет преобразовывать десятичное число в двоичное.
#    Пример: 45 101101
#            3  11
#            2  10
           

# Clear();
# WriteLine("Введите десятичное число");
# int tennum = int.Parse(ReadLine());
# string box2 = string.Empty;
# while(tennum >=1)   
# {
# string box1 = (tennum % 2).ToString("G");
# box2 = box1 + " " + box2;
# tennum = tennum / 2;
# }

decimal_number = int(input("введите число в десятичном формате: "))
while decimal_number >= 1:
    binary_number1=int(decimal_number%2)
    binary_number2=binary_number1
    decimal_number=int(decimal_number/2)
print(decimal_number)
# 5. Задайте число. Составьте список числе Фибоначи, в том числе для отрицательных индексов.
# Пример:

#     - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи](https://ru.wikipedia.org/wiki/%D0%9D%D0%B5%D0%B3%D0%B0%D1%84%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8#:~:text=%D0%92%20%D0%BC%D0%B0%D1%82%D0%B5%D0%BC%D0%B0%D1%82%D0%B8%D0%BA%D0%B5%2C%20%D1%87%D0%B8%D1%81%D0%BB%D0%B0%20%D0%BD%D0%B5%D0%B3%D0%B0%D1%84%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8%20%E2%80%94%20%D0%BE%D1%82%D1%80%D0%B8%D1%86%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%20%D0%B8%D0%BD%D0%B4%D0%B5%D0%BA%D1%81%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%BD%D1%8B%D0%B5%20%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%D0%B4%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D1%81%D1%82%D0%B8%20%D1%87%D0%B8%D1%81%D0%B5%D0%BB%20%D0%A4%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8.)


# 	Пример:         
