
def raz (x,y):
    s = x-y
    return s
a = 3.20000000000000000000000000000000000000000000000000
b = 0.01673640167364016736401673640167364016736401673640
print(raz(a, b))


# Вычислить число Пи c заданной точностью d
#
# Пример:
#
#     - при d = 0.0001,  π = 3.1415    10^-1 ≤ d ≤10^-10
# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
#
# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
# Пример:
# - Ввод:[1,1,2,4,5,6,7,7,8], результат: [2,4,5,6,8]
#
# Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100)* многочлена и записать в файл многочлен степени k.
#
#     *Пример:*
#
#     - k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0
#     -  k=5 => 2*x^5 + 4*x^4 + 2*x^3 + 2*x^2 + 4*x + 5 = 0
# Даны два файла, в каждом из которых находится запись многочлена. Задача - сформировать файл, содержащий сумму многочленов.(одинаковый размер уравнений)*
#
# *Доп задание: значения коэффициентов от -100 до 100
# *Доп задание: для разного размера уравнения
#
# # Сдайте задание до: 22 дек., 20:00 +03:00 UTC