# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
# Пример:
# - Ввод:[1,1,2,4,5,6,7,7,8], результат: [2,4,5,6,8]

lst2=[]
lst1 = [1,1,2,4,5,6,7,7,8]
for i in lst1:
    if 1 == lst1.count(i):
        lst2.append(i)
print(lst2)
