x = int(input('Введите значение координаты точки X = '))
y = int(input('Введите значение координаты точки Y = '))

if x > 0 and y > 0:
    print('точка введеных координат расположена в 1 четверти плоскости системы координат')
elif x > 0 and y < 0:
    print('точка введеных координат расположена в 2 четверти плоскости системы координат')
elif x < 0 and y < 0:
    print('точка введеных координат расположена в 3 четверти плоскости системы координат')
elif x < 0 and y > 0:
    print('точка введеных координат расположена в 4 четверти плоскости системы координат')
